In [1]:
import pyspark

In [2]:
from pyspark.sql import SparkSession

In [3]:
spark = SparkSession.builder.appName("PySpark").getOrCreate()

In [4]:
spark

In [5]:
#Initializing the list of data
data = [['tom', 10], ['nick', 15], ['juli', 14]]
df = spark.createDataFrame(data, ['Name', 'Age'])

In [6]:
df

DataFrame[Name: string, Age: bigint]

In [7]:
df.show()

+----+---+
|Name|Age|
+----+---+
| tom| 10|
|nick| 15|
|juli| 14|
+----+---+

In [8]:
df.show(1)

+----+---+
|Name|Age|
+----+---+
| tom| 10|
+----+---+
only showing top 1 row

In [9]:
df.head()

Row(Name='tom', Age=10)

In [10]:
df.toPandas()

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [11]:
df.columns

['Name', 'Age']

In [12]:
df.count()

3

Read in Data

In [13]:
path = 'zz//Datasets//students.csv'

In [14]:
df_file = spark.read.csv(path, header=True)

In [15]:
df_file

DataFrame[gender: string, race/ethnicity: string, parental level of education: string, lunch: string, test preparation course: string, math score: string, reading score: string, writing score: string]

In [16]:
df_file.toPandas()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [17]:
df_file.groupBy("gender").agg({'math score': 'mean'}).show()

+------+------------------+
|gender|   avg(math score)|
+------+------------------+
|female|63.633204633204635|
|  male| 68.72821576763485|
+------+------------------+

In [18]:
from pyspark.sql import functions as F

In [19]:
df_file.groupBy('gender').agg(F.min('math score'), F.max('math score'), F.avg('math score')).show()

+------+---------------+---------------+------------------+
|gender|min(math score)|max(math score)|   avg(math score)|
+------+---------------+---------------+------------------+
|female|              0|             99|63.633204633204635|
|  male|            100|             99| 68.72821576763485|
+------+---------------+---------------+------------------+